chore: change plantuml to mermaid
